---
type: AssetPropertyDistance
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 3
tags: [revit-api, class]
---

# AssetPropertyDistance

`Autodesk.Revit.DB.Visual.AssetPropertyDistance` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetUnitTypeId | — | `public ForgeTypeId GetUnitTypeId ()` |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( double value )` |
| Property | Value | — | `public double Value { get ; set ; }` |